opensource-apple/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI_PwrMgmt.cpp
        }
    }
    return kIOReturnSuccess;
}

static IOACPIPlatformDevice * CopyACPIDevice( IORegistryEntry * device )
{
	IOACPIPlatformDevice *  acpiDevice = 0;
	OSString *				acpiPath;

	if (device)
	{
		acpiPath = (OSString *) device->copyProperty(kACPIDevicePathKey);
		if (acpiPath && !OSDynamicCast(OSString, acpiPath))
		{
			acpiPath->release();
			acpiPath = 0;
		}

		if (acpiPath)
		{
			IORegistryEntry * entry;

			entry = IORegistryEntry::fromPath(acpiPath->getCStringNoCopy());
			acpiPath->release();

			if (entry && entry->metaCast("IOACPIPlatformDevice"))
				acpiDevice = (IOACPIPlatformDevice *) entry;
			else if (entry)
				entry->release();
		}
	}

	return (acpiDevice);
}

static bool HasExpressCardUSB( IORegistryEntry * acpiDevice, UInt32 * portnum )
{
	const IORegistryPlane *	acpiPlane;
	bool					match = false;
	IORegistryIterator *	iter;
	IORegistryEntry *		entry;

	do {
		acpiPlane = acpiDevice->getPlane( "IOACPIPlane" );
		if (!acpiPlane)
			break;

		// acpiDevice is the USB controller in ACPI plane.
		// Recursively iterate over children of acpiDevice.

		iter = IORegistryIterator::iterateOver(
				/* start */	acpiDevice,
				/* plane */	acpiPlane,
				/* options */ kIORegistryIterateRecursively);

		if (iter)
		{
			while (!match && (entry = iter->getNextObject()))
			{
				// USB port must be a leaf node (no child), and
				// must be an IOACPIPlatformDevice.

				if ((entry->getChildEntry(acpiPlane) == 0) &&
					entry->metaCast("IOACPIPlatformDevice"))
				{
					IOACPIPlatformDevice * port;
					port = (IOACPIPlatformDevice *) entry;

					// Express card port? Is port ejectable?

					if (port->validateObject( "_EJD" ) == kIOReturnSuccess)
					{
						// Determining the USB port number.
						if (portnum)
							*portnum = strtoul(port->getLocation(), NULL, 10);
						match = true;
					}
				}
			}

			iter->release();
		}
	}
	while (false);
	
	return match;
}

// Checks for ExpressCard connected to this controller, and returns the port number (1 based)
// Will return 0 if no ExpressCard is connected to this controller.
//
UInt32 
AppleUSBEHCI::ExpressCardPort( IOService * provider )
{
	IOACPIPlatformDevice *	acpiDevice;
	UInt32					portNum = 0;
	bool					isPCIeUSB;
	
	acpiDevice = CopyACPIDevice( provider );
	if (acpiDevice)
	{
		isPCIeUSB = HasExpressCardUSB( acpiDevice, &portNum );	
		acpiDevice->release();
	}
	return(portNum);
}



void
AppleUSBEHCI::SynchronizeCompanionRootHub(IOUSBControllerV2* companion)
{
	int		i = 0;
	
	USBLog(4, "AppleUSBEHCI[%p]::SynchronizeCompanionRootHub for %s companion[%p]", this, companion->getName(), companion);
	if (!_companionWakeHoldoff)
	{
		USBLog(2, "AppleUSBEHCI[%p]::SynchronizeCompanionRootHub - no holdoff needed", this);
	}
	else
	{
		while (_companionWakeHoldoff)
		{
			if ((i++ % 100) == 0)
			{
				USBLog(2, "AppleUSBEHCI[%p]::SynchronizeCompanionRootHub - waiting on behalf of companion[%p]", this, companion);
			}
			IOSleep(10);		// wait for 10 milliseconds before checking again
			
			// After 10 seconds, give up
			if ( i > 1000)
			{
				USBLog(2, "AppleUSBEHCI[%p]::SynchronizeCompanionRootHub - Companion controller[%p] did not come up after 10 seconds!", this, companion);
				USBError(1, "USB:  The companion controller[%p] for %p did not come up after 10 seconds!", companion, this);
			}
		}
		USBLog(2, "AppleUSBEHCI[%p]::SynchronizeCompanionRootHub - companion[%p] is ready to go!!", this, companion);
	}
}
